Revit 2026 API

# ITransactionFinalizer Methods

---

The ITransactionFinalizer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | OnCommitted | This method is called at the end of committing a transaction |
|  | OnRolledBack | This method is called at the end of rolling back a transaction |

#### Reference

ITransactionFinalizer Interface

Autodesk.Revit.DB Namespace